## Введение в Python. Цикл for

**Цель работы:** Изучить, как пользоваться циклом for

**Задачи работы:**
1. Изучить теоретический материал
2. Составить алгоритмы по заданию
### Практическая часть
#### Задание 1
Напишите программу, которая вычисляет сумму чисел от 1 до n(введённого пользователем числа).

**Пример:**  
Ввод: `5`  
Вывод: `15` (1 + 2 + 3 + 4 + 5)
```python
a = int(input("Введите число: "))
sum_numbers = 0
for i in range(1, a + 1):
    sum_numbers += i
print(f"Сумма чисел от 1 до {a}: {sum_numbers}")
```
#### Задача 2
выведите таблицу умножения для введённого пользователем числа в формате:
```
n * 1 = result
n * 2 = result
...
n * 10 = result
```

**Пример:**  
Ввод: `3`  
Вывод:
```
3 * 1 = 3
3 * 2 = 6
...
3 * 10 = 30
```

```python
number = int(input("Введите число для таблицы умножения: "))
print(f"Таблица умножения для числа {number}:")
print("-" * 25)
for i in range(1,11):
    result = number * i
    print(f"{i}. {number} * {i} = {result}")
```
#### Задача 3
Пользователь вводит произвольный текст неопределённой длины. Подсчитайте сколько в тексте букв *(подходит как кириллица, так и латиница)*, цифр, знаков препинания *(точка, запятая, воск. знак, вопрос, двоеточие, точка с запятой)* и пробелов

**Пример:**  
Ввод: `"По полю шёл, ничего не нашёл. Устал, BOYZZZ99"`  
Вывод:
```
букв = 33
цифр = 2
знаков препинания = 3
пробелов = 7
```

```python
text = input("Введите текст: ")
letters_count = 0
digits_count = 0
punctuation_count = 0
spaces_count = 0
punctuation = ".,!?;:"
for char in text:
    if char.isalpha():
        letters_count += 1
    elif char.isdigit():
        digits_count += 1
    elif char in punctuation:
        punctuation_count += 1
    elif char == ' ':
        spaces_count +=1
print(f"букв = {letters_count}")
print(f"цифр = {digits_count}")
print(f"знаков препинания = {punctuation_count}")
print(f"пробелов = {spaces_count}")
```
#### Задача 4
Напишите программу, которая выводит числовую пирамиду высотой n:

**Пример:**  
Ввод: `4`
Вывод:
```
   1
  121
 12321
1234321
```

*Примечание: используйте вложенные циклы!*
```python
a = int(input("Введите высоту пирамиды: "))
print("Числовая пирамида: ")
for i in range(1, a + 1):
    for j in range(1, i + 1):
        print(j, end = "")
    for j in range(i - 1, 0, -1):
        print(j,end = "")
    print()
```
#### Задача 5
Напишите программу, которая должна:
1. Запросить количество чисел для ввода
2. Принять все числа
3. Найти: максимальное, минимальное, среднее арифметическое из введённых чисел
4. Посчитать сколько чисел больше среднего

**Пример:**  
Ввод:
```
Сколько чисел вы хотите ввести? 5
Введите число 1: 10
Введите число 2: 20
Введите число 3: 30
Введите число 4: 40
Введите число 5: 50
```
Вывод:
```
Результаты:
Максимальное: 50
Минимальное: 10
Среднее: 30.0
Чисел больше среднего: 2
```

```python
a = int(input("Сколько чисел вы хотите ввести? "))
numbers = []
for i in range(a):
    num = float(input(f"Введите число {i + 1}: "))
    numbers.append(num)
max_number = max(numbers)
min_number = min(numbers)
average = sum(numbers)/a
count_above_average = 0
for num in numbers:
    if num > average:
        count_above_average += 1
print(f"Результаты:")
print(f"Максимальное: {max_number}")
print(f"Минимальное: {min_number}")
print(f"Среднее: {average}")
print(f"Чисел больше среднего: {count_above_average}")
```