## Введение в Python. Цикл While

**Цель работы:** Изучить, как пользоваться циклом While

**Задачи работы:**
1. Изучить теоретический материал
2. Составить алгоритмы по заданию
### Практическая часть
#### Задание 1
Напишите программу, которая вычисляет сумму цифр введенного пользователем положительного целого числа. Используйте цикл `while` для обработки каждой цифры.

**Пример:**  
Ввод: `123`  
Вывод: `6` (1 + 2 + 3)
```python
num = int(input("Введите число: "))
zero = 0
while num > 0:
    last_num = num % 10
    zero = zero + last_num
    num = num // 10
print("Сумма цифр: ", zero)
```
#### Задача 2
Программа должна запрашивать у пользователя числа до тех пор, пока не будет введен ноль. Выведите количество введенных чисел до первого нуля (не включая ноль).

**Пример:**  
Ввод: `5`, `3`, `-2`, `0`  
Вывод: `3`
```python
schet = 0
print("Введите числа, для остановки введите 0: ")
while True:
    num = int(input("Введите число: "))
    if num == 0:
        break
    schet = schet + 1
print("Количество чисел: ",schet)
```
#### Задача 3
Пользователь вводит строку. Проверьте, является ли она палиндромом (читается одинаково слева направо и справа налево), используя цикл `while`. Игнорируйте регистр символов и пробелы.
**Пример:**  
Ввод: `"А роза упала на лапу Азора"`  
Вывод: `Да, это палиндром`
```python
stroka = input("Введите строку: ")
chist = stroka.lower().replace(" ","")
left = 0
right = len(chist) - 1
palindrom = True
while right > left:
    if chist[left] != chist[right]:
        palindrom = False
        break
    left = left + 1
    right = right -1
if palindrom:
    print("Да, это палиндром")
else:
    print("Нет, это не палиндром")
```
#### Задача 4
Программа загадывает случайное число от 1 до 100. Пользователь должен угадать его. На каждую попытку программа выводит «Больше» или «Меньше». Цикл `while` завершается, когда число угадано.

**Пример:**  
Загадано: `42`  
Ввод: `50` → Вывод: `Меньше`  
Ввод: `25` → Вывод: `Больше`  
Ввод: `42` → Вывод: `Угадал!`

*Примечание:* Используйте `random.randint(1, 100)` для генерации числа
```python
from random import randint
random_num = randint(1, 100)
```

```python
from random import randint
random_num = randint(1, 100)
pop = 0
print("Угадай число от 1 до 100",random_num)
while True:
    print("Попробуйте угадать число")
    num = int(input("Введите число: "))
    pop = pop + 1
    if num == random_num:
        print(f"Угадал c {pop} попытки")
        break
    elif num < random_num:
        print("Больше, попробуй еще")
    else:
        print("Меньше, попробуй еще")
```
#### Задача 5
Пользователь вводит строку. Удалите из нее все гласные буквы (кириллические или латинские) с помощью цикла `while` и выведите результат.

**Пример:**  
Ввод: `"Привет, мир!"`  
Вывод: `"Првт, мр!"`
```python
text = input("Введите строка: ")
glas = "аеёиоуыэюяaeiou"
glas += glas.upper()
result = ""
i = 0
while i < len(text):
    char = text[i]
    if char not in glas:
        result += char
    i += 1
print(f"Результат: {result}")

```
#### Задача 6
Напишите программу, которая рисует прямоугольный узор из заданного символа. Пользователь вводит:
- символ для рисования
- высоту прямоугольника
- ширину прямоугольника
```python

```
**Пример:** 
Ввод:
```
Символ: *
Высота: 3
Ширина: 5
```

Вывод:
```
*****
*****
*****
```

Используйте **вложенные циклы while** для создания прямоугольника.
```python
symbol = input("Выберите символ для рисования: ")
height = int(input("Введите высоту прямоугольника: "))
width = int(input("Введите ширину прямоугольника: "))
print("Результат:")
row = 0
while row < height:
    col = 0
    line = ""
    while col < width:
        line += symbol
        col += 1
    print(line)
    row += 1

```
#### Задача 7* (+1 доп балл)
Возьмите вывод прямоугольника из задачи 6 и сделайте так, чтобы его внутренняя часть была пустой

**Пример:** 
Ввод:
```
Символ: *
Высота: 3
Ширина: 5
```

Вывод:
```
*****
*   *
*****
```
