## Коллекции. Словари

**Цель работы:** Изучить, как пользоваться словарями и их методами

**Задачи работы:**
1. Изучить теоретический материал
2. Составить алгоритмы по заданию
### Практическая часть
#### Задание 1
Представьте себя продавцом фруктов на рынке. Вам требуется ввести тщательный учёт фруктов, поэтому вы должны написать себе программу по их учёту:
1. Создайте словарь, который изначально будет хранить яблоки в количестве 5 штук, 3 банана, 10 апельсинов и 33 арбуза.
2. В самом начале выведите сообщение, сколько каждого фрукта хранится за прилавком в виде: `За прилавком есть [количество] [фрукт]` для каждого фрукта.
3. Далее мы продали 2 яблока, достаём 2 яблока из-за прилавка. Обновите количество яблок в словаре
4. Ночью коварный враг вашего ларька - *Ашот Похититель Арбузов* украл все ваши арбузы. Обновите словарь
5. Выведите итоговый словарь в формате: `За прилавком осталось [количество] [фрукт]`

```python
fruits = {
    "яблок": 5,
    "бананов": 3,
    "апельсинов": 10,
    "арбузов":33
}
print("Начальное количество фруктов:")
for fruit, count in fruits.items():
    print(f"за прилавком есть {count} {fruit}")
print()
print("Продали 2 яблока")
fruits["яблок"] = fruits["яблок"] - 2
print("Ашот Похититель Арбузов украл все арбузы!")
fruits["арбузов"] = 0
print()
print("Итоговое количество фруктов:")
for fruit, count in fruits.items():
    print(f"за прилавком осталось {count} {fruit}")
```
#### Задача 2
Напишите программу, которая принимает от пользователя произвольный текст и подсчитывает, сколько раз в ней встречается каждый символ (без учёта регистра). Программа должна:
1. Просить пользователя ввести произвольную строку
2. Создавать словарь, где ключ - символ, а значение - сколько раз он встретился в строке.
3. Выводить полученный словарь

**Пример:**  
Ввод: `Hello World`  
Вывод:
```
{'h': 1, 'e': 1, 'l': 3, 'o': 2, ' ': 1, 'w': 1, 'r': 1, 'd': 1, '!': 1}
```

```python
text = input("Введите произвольный текст: ")
text = text.lower()
symbol_count = {}
for char in text:
    if char in symbol_count:
        symbol_count[char] = symbol_count[char] + 1
    else:
        symbol_count[char] = 1
print("Результат подсчета символов: ")
print(symbol_count)
```
#### Задача 3
Создайте простую телефонную книгу:
1. Создайте словарь `phone_book`, где ключ - имя контакта, а значение - его номер телефона. Заполните его 3-4 произвольными записями.
2. Напишите цикл, который будет постоянно предлагать пользователю выбрать действие:
	- 1 - показать все контакты
	- 2 - Добавить контакт
	- 3 - Удалить контакт
	- 4 - Выйти
3. Реализуйте каждое действие:
	- Показать контакты: выводит все пары `Имя: телефон`
	- Добавить контакт: запрашивает имя и телефон, добавляет их в словарь. Если имя существует, выводит сообщение о том, что контакт с подобным именем уже есть.
	- Удалить контакт: запрашивает имя и удаляет контакт. Если контакт не найден, выводит сообщение о том, что такого контакта не существует.
	- Выйти: завершает программу (используйте `exit()`)
	
```python
phone_book = {
    "Мама": "8-900-123-45-67",
    "Папа": "8-900-987-65-43",
    "Сестра": "8-901-555-44-33",
    "Друг": "8-902-111-22-33"
}
while True:
    print("Телефоная книга:")
    print("Выберите действие:")
    print("1 - Показать все контакты")
    print("2 - Добавить контакт")
    print("3 - Удалить контакт")
    print("4 - Выйти")
    choice = input("Введите номер действия (1-4): ")
    if choice == "1":
        print("Все контакты")
        if len(phone_book) == 0:
            print("Телефонная книга пуста")
        else:
            for name, phone in phone_book.items():
                print(f"{name}: {phone}")
    elif choice == "2":
        name = input("Введите имя контакта:")
        phone = input("Введите номер телефона:")
        if name in phone_book:
            print(f"Контакт с именем '{name}' уже существует")
        else:
            phone_book[name] = phone
            print(f"Контакт '{name}' успешно добавлен!")
    elif choice == "3":
        name = input("Введите имя контакта для удаления")
        if name in phone_book:
            del phone_book[name]
            print(f"Контакт с именем '{name}' успешно удален")
        else:
            print(f"Контакт с именем '{name}' не найден!")
    elif choice == "4":
        print("До свидания!")
        exit()
    else:
        print("Неверный выбор! Введите число от 1 до 4")
```
#### Задача 4
Дан следующий словарь
```python
products = {
    "Ноутбук": {"price": 50000, "sold": 15},
    "Мышь": {"price": 1000, "sold": 45},
    "Клавиатура": {"price": 2500, "sold": 30},
    "Монитор": {"price": 30000, "sold": 8}
}
```

Напишите программу, которая:
1. Находит самый продаваемый товар (с максимальным значением **sold**) и выводит его название
2. Рассчитывает общую выручку магазина по формуле `цена * количество`
3. Находит товар, который принёс наибольшую выручку и выводит его

```python
products = {
    "Ноутбук": {"price": 50000, "sold": 15},
    "Мышь": {"price": 1000, "sold": 45},
    "Клавиатура": {"price": 2500, "sold": 30},
    "Монитор": {"price": 30000, "sold": 8}
}
max_sold = 0
best_selling_product = ""
for product_name, product_info in products.items():
    if product_info["sold"] > max_sold:
        max_sold = product_info["sold"]
        best_selling_product = product_name
print(f"1. Самый продаваемый товар: {best_selling_product} (Продано {max_sold} шт.)")
total_revenue = 0
for product_name, product_info in products.items():
    revenue = product_info["price"] * product_info["sold"]
    total_revenue = total_revenue + revenue
print(f"2. Общая выручка магазина: {total_revenue} рублей")
max_revenue = 0
best_revenue_product = ""
for product_name, product_info in products.items():
    revenue = product_info["price"] * product_info["sold"]
    if revenue > max_revenue:
        max_revenue = revenue
        best_revenue_product = product_name
print(f"3. Товар с наибольшей выручкой: {best_revenue_product} (выручка {max_revenue} рублей)")

```
#### Задача 5
Напишите программу, которая считывает текст из многострочного ввода (пользователь вводит текст бесконечно, пока не введёт пустую строку) и организует:
**Словарь статистики слов**: Ключ - слово в нижнем регистре (знаки препинания игнорируются), значение - сколько раз это слово встретилось в тексте

**Пример:** 
Ввод:
```text
Hello world!  
Hello Python.

```

Вывод:
```text
Статистика слов: {'hello': 2, 'world': 1, 'python': 1}`
```

```python
statistics = {}
while True:
    text = input()
    if text == "":
        break
    words = text.split()
    for word in words:
        clean_word = ""
        for char in word:
            if char.isalpha():
                clean_word += char
        clean_word = clean_word.lower()
        if clean_word == "":
            continue
        if clean_word in statistics:
            statistics[clean_word] += 1
        else:
            statistics[clean_word] = 1
print("Статистика слов:", statistics)
```