## Генераторы и итераторы

**Цель работы:** Изучить принцип работы протокола итерации, научиться создавать функции-генераторы с использованием <mark style="background: #D2B3FFA6;">yield</mark>, применять генераторные выражения и освоить работу с бесконечными последовательностями.

**Задачи работы:**
1. Изучить теоретический материал
2. Составить алгоритмы по заданию
### Практическая часть

#### Задание 1
Напишите функцию-генератор `squares_gen(n)`, которая принимает число `n` и возвращает квадраты всех чисел от 1 до `n` (включительно).

**Пример:**  
Ввод:
```python
gen = squares_generator(4)
for val in gen:
    print(val)
```
Вывод:
```
1
4
9
16
```

```python
def squares_gen(n):
    for i in range(1, n + 1):
        square = i * i
        yield square
gen = squares_gen(4)
for val in gen:
    print(val)
```
#### Задача 2
Напишите программу, которая создает **генераторное выражение** (generator expression). Оно должно генерировать только **четные** числа из списка `range(10, 21)`. Выведите эти числа в цикле.

**Пример:**  
Ввод:
```python
# Код создания генератора (одна строка)
# ...

for num in my_gen:
    print(num)
```
Вывод:
```
10
12
14
16
18
20
```

```python
my_gen = (num for num in range(10, 21) if num % 2 == 0)
for num in my_gen:
    print(num)
```
#### Задача 3
Напишите функцию-генератор `fibonacci(n)`, которая генерирует первые `n` чисел последовательности Фибоначчи.
*Напоминание: Последовательность начинается с 0 и 1, а каждое следующее число — это сумма двух предыдущих.*

**Пример:**  
Ввод:
```python
for num in fibonacci(6):
    print(num)
```
Вывод:
```
0
1
1
2
3
5
```

```python
def fibonacci(n):
    a, b = 0, 1
    count = 0
    while count < n:
        yield a
        a, b = b, a + b
        count += 1
for num in fibonacci(6):
    print(num)
```
#### Задача 4
Напишите функцию-генератор `my_range(start, end, step)`, которая работает аналогично встроенной функции <mark style="background: #FFF3A3A6;">range</mark>. Функция должна поддерживать дробный шаг (float).

**Пример:**  
Ввод:
```python
for i in my_range(1, 3, 0.5):
    print(i)
```
Вывод:
```
1
1.5
2.0
2.5
```

```python
def my_range(start, end, step):
    current = start
    while current < end:
        yield current
        current += step
for i in my_range(1, 3, 0.5):
    print(i)
```
#### Задача 5
Напишите функцию-генератор `filter_logs(log_lst, keyword)`, которая принимает список строк (логов) и ключевое слово. Генератор должен возвращать только те строки, которые содержат указанное ключевое слово.
Используйте эту функцию для фильтрации списка, имитирующего файл логов.

**Пример:**  
Ввод:
```python
logs = [
    "INFO: Server started",
    "ERROR: Database connection failed",
    "INFO: User logged in",
    "ERROR: File not found"
]

for error in filter_logs(logs, "ERROR"):
    print(error)
```

Вывод:
```
ERROR: Database connection failed
ERROR: File not found
```

```python
def filter_logs(log_list, keyword):
    for log in log_list:
        if keyword in log:
            yield log
logs = [
    "INFO: Server started",
    "ERROR: Database connection failed",
    "INFO: User logged in",
    "ERROR: File not found"
]
print("Все ERROR логи:")
for error in filter_logs(logs, "ERROR"):
    print(error)
```